{
    "format": "layers-model",
    "generatedBy": "keras v2.4.0",
    "convertedBy": "TensorFlow.js Converter v2.8.2",
    "modelTopology": {
        "keras_version": "2.4.0",
        "backend": "tensorflow",
        "model_config": { "class_name": "Sequential", "config": { "name": "sequential_135", "layers": [{ "class_name": "InputLayer", "config": { "batch_input_shape": [null, 28], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_342_input" } }, { "class_name": "Dense", "config": { "name": "dense_342", "trainable": true, "batch_input_shape": [null, 28], "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } }, "bias_initializer": { "class_name": "Zeros", "config": {} }, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null } }, { "class_name": "Dense", "config": { "name": "dense_343", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } }, "bias_initializer": { "class_name": "Zeros", "config": {} }, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null } }, { "class_name": "Dense", "config": { "name": "dense_344", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } }, "bias_initializer": { "class_name": "Zeros", "config": {} }, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null } }] } },
        "training_config": {
            "loss": "mse",
            "metrics": [
                [{ "class_name": "MeanMetricWrapper", "config": { "name": "mae", "dtype": "float32", "fn": "mean_absolute_error" } }, { "class_name": "MeanMetricWrapper", "config": { "name": "mse", "dtype": "float32", "fn": "mean_squared_error" } }]
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": { "class_name": "RMSprop", "config": { "name": "RMSprop", "learning_rate": 0.00989999994635582, "decay": 0.0, "rho": 0.8999999761581421, "momentum": 0.0, "epsilon": 1e-07, "centered": false } }
        }
    },
    "weightsManifest": [{ "paths": ["group1-shard1of1.bin"], "weights": [{ "name": "dense_342/kernel", "shape": [28, 64], "dtype": "float32" }, { "name": "dense_342/bias", "shape": [64], "dtype": "float32" }, { "name": "dense_343/kernel", "shape": [64, 64], "dtype": "float32" }, { "name": "dense_343/bias", "shape": [64], "dtype": "float32" }, { "name": "dense_344/kernel", "shape": [64, 1], "dtype": "float32" }, { "name": "dense_344/bias", "shape": [1], "dtype": "float32" }] }]
}